Repository: uholeschak/ediabaslib
Catalog: EdiabasLib/EdiabasLibConfigTool/Resources/Strings.*.resx
Languages: de, fr, ru

# BtInitError
source: Bluetooth init failed: {0}
de: Bluetooth Initialisierung fehlgeschlagen: {0}
fr: Initialisation du Bluetooth échouée: {0}
ru: Ошибка инициализации Bluetooth: {0}

# ButtonTestCheck
source: Check Connection
de: Verbindung prüfen
fr: Test de Connection
ru: Проверка соединения

# ButtonTestConfiguration
source: Adapter Configuration
de: Adapter Konfiguration
fr: Configuration de l'Adaptater
ru: Конфигурация ODB устройства

# ButtonTestConnect
source: Connect
de: Verbinden
fr: Connection
ru: Соединить

# CanMode
source: Adapter mode:
de: Adapter Modus:
fr: Mode de l'Adaptater:
ru: Режим ODB устройства:

# CanModeAuto
source: Automatic
de: Automatisch
fr: Automatique
ru: Автоматический

# CanModeChangeAuto
source: Changing CAN mode to automatic
de: CAN Modus wird auf automatisch geändert
fr: Changement du mode CAN en automatique
ru: Изменение CAN режима на автоматический

# CanModeChangeFailed
source: Changing CAN mode failed
de: CAN Modus ändern fehlgeschlagen
fr: Changement du mode CAN échoué
ru: Ошибка при изменении CAN режима

# CanModeNotAuto
source: It's recommended to use automatic adapter mode.
de: Es wird empfohlen den automatischen Adapter-Modus zu verwenden.
fr: Il est recommendé d'utiliser le mode automatique de l'adaptateur.
ru: Рекомендуется использовать автоматический режим ODB устройства.

# CanModeUnknown
source: Unknown
de: Unbekannt
fr: Inconnu
ru: Неизвестный

source: Connected
de: Verbunden
fr: Connecté
ru: Подключено

source: Connecting ...
de: Verbinden ...
fr: Connection ...
ru: Соединение ...

source: Connection failed
de: Verbindung fehlgeschlagen
fr: Connection échouée
ru: Ошибка подключения

# DevicesFound
source: Select a device to perform an operation.
de: Wählen Sie ein Gerät um einen Vorgang auszuführen.
fr: Selectionner un appareil pour réaliser une opération.
ru: Выберите устройство для выполнения операции.

# DevicesNotFound
source: No devices found.
de: Keine Geräte gefunden.
fr: Aucun appareil trouvé.
ru: Устройство не найдено.

# DisconnectedAdapter
source: Disconnected Wi-Fi adapter
de: Getrennter Wi-Fi Adapter
fr: adaptater Wi-Fi déconnecté
ru: Не подключённое Wi-Fi устройство

# FirmwareTooOld
source: Firmware too old, please update firmware with Deep OBD App.
de: Die Firmware ist zu alt, bitte aktualisieren Sie die Firmware mit der Deep OBD App.
fr: Firmware trop ancien, merci de mettre à jour le firmware avec l'application Deep OBD.
ru: Прошивка ODB устройства устарела, пожалуйста, обновите прошивку при помощи приложения Deep OBD.

# HttpResponseIncorrect
source: HTTP response invalid
de: HTTP Antwort ungültig
fr: Réponse HTTP invalide
ru: HTTP ответ недействительный

source: HTTP response OK
de: HTTP Antwort OK
fr: Réponse HTTP OK
ru: HTTP ответ OK

# PatchApiDllMissing
source: EdiabasLib {0} file is missing.
de: EdiabasLib {0} Datei fehlt.
fr: Le file EdiabasLib {0} est manquant.
ru: EdiabasLib {0} файл отсутствует.

# PatchBackupFileExisting
source: Backup file {0} is already existing.
de: Die Backup-Datei {0} ist bereits vorhanden.
fr: Le fichier de sauvegarde {0} existe déjà.
ru: Файл резервной {0} копии уже существует.

# PatchConfigExisting
source: EdiabasLib.config file is already existing.
de: Die EdiabasLib.config Datei existiert bereits.
fr: Le fichier EdiabasLib.config existe déjà.
ru: Die EdiabasLib.config файл уже существует.

# PatchConfigMissing
source: EdiabasLib.config file is missing.
de: Die EdiabasLib.config Datei fehlt.
fr: Le fichier EdiabasLib.config est manquant.
ru: Die EdiabasLib.config файл отсутствует.

# PatchConfigUpdateFailed
source: Update config file failed.
de: Aktualisierung der Konfig-Datei fehlgeschlagen.
fr: Mise à jour du fichier de configuration échouée.
ru: Не удалось обновить конфигурационный файл.

# PatchConfigUpdateOk
source: Update config file successful.
de: Aktualisierung der Konfig-Datei erfolgreich.
fr: Mise à jour du fichier de configuration réussie.
ru: Конфигурационный файл успешно обновлён.

# PatchCopyFailed
source: Copy files failed.
de: Kopieren der Dateien fehlgeschlagen.
fr: Copie des fichiers échouée.
ru: Не удалось скопировать файлы.

# PatchCreateBackupFile
source: Creating backup file {0}.
de: Backup-Datei {0} wird erzeugt.
fr: Création du fichier de sauvegarde {0}.
ru: Создание файла резервной копии {0}.

# PatchDirectory
source: Patching EDIABAS at: '{0}'
de: Patchen von EDIABAS bei: '{0}'
fr: Patch de EDIABAS à : '{0}'
ru: Заплатка EDIABAS: '{0}'

source: Read firmware version failed
de: Firmware-Version lesen fehlgeschlagen
fr: Lecture de la version du firmware échouée
ru: Не удалось считать версию прошивки

# ReadModeFailed
source: Read adapter mode failed
de: Adapter-Modus lesen fehlgeschlagen
fr: Lecture du mode de l'adaptateur échouée
ru: Не удалось установить режим устройства

# RestoreApiDllFailed
source: Restoring original {0} file failed.
de: Wiederherstellen der originalen {0} Datei fehlgeschlagen.
fr: Restoration du fichier original {0} échouée.
ru: Не удалось восстановить исходный {0} файл.

# RestoredApiDll
source: Restored original {0} file.
de: Originale {0} Datei wiederhergestellt.
fr: Fichier original {0} restauré.
ru: Оригинальный {0} файл восстановлен.

# RestoreDirectory
source: Restoring EDIABAS at: '{0}'
de: Wiederherstellen von EDIABAS bei: '{0}'
fr: Restoration de EDIABAS à : '{0}'
ru: Восстановление EDIABAS: '{0}'

# RestoreNoBackupFile
source: No backup file {0} existing.
de: Keine Backup-Datei {0} vorhanden.
fr: Aucun fichier de sauvegarde {0} existant.
ru: Файл резервной {0} копии отсутствует.

source: Searching ...
de: Suchen ...
fr: Recherche ...
ru: Поиск ...

source: Searching failed
de: Suchen fehlgeschlagen
fr: Recherche échouée
ru: Не удалось выполнить поиск

# SearchingFailedMessage
source: Searching failed: {0}
de: Suchen fehlgeschlagen: {0}
fr: Recherche échouée : {0}
ru: Не удалось выполнить поиск: {0}

# WifiAdapterError
source: No Wi-Fi adapter found.
de: Kein Wi-Fi Adapter gefunden.
fr: Aucun adaptateur Wi-Fi adapter trouvé.
ru: Wi-Fi устройство не найдено.

# WifiUrlOk
source: The adapter configuration page will be opened in the web browser. The default root password is {0}.
de: Die Adapter-Konfigurationsseite wird im Browser geöffnet. Das Standard root Password ist {0}.
fr: La page de configuration de l'adaptateur va s'ouvrir dans le navigateur web. Le mot de passe root par défaut est {0}.
ru: Страница конфигурации адаптера открывается в браузере. Пароль по умолчанию - {0}.

# PatchApiVersion
source: API version: {0}
fr: Version API : {0}
ru: API версия: {0}

# PatchLoadApiDllFailed
source: Unable to load {0}. Has the archive been extracted correctly?
de: Kann {0} nicht laden. Wurde das Archiv korrekt extrahiert?
fr: Impossible de charger {0}. L'archive a-t-elle été extraite correctement ?
ru: Не удалось загрузить {0}. Распаковка архива прошла успешно?

# PatchNoValidBackupFile
source: The {0} backup file is not valid.
de: Die {0} Backup-Datei ist ungültig.
fr: Le fichier de sauvegarde {0} est non valide.
ru: {0} файл резервной копии повреждён или не является таковым.

# LanguageDe
source: Deutsch
fr: Allemand

# LanguageEn
source: English
fr: Anglais

# LanguageRu
source: Pусский
fr: Russe

# LanguageFr
source: French
de: Français
fr: Français
ru: Français

# PatchIstadInfoEdiabas
source: 'Ediabas default settings (ediabas.ini)'
de: 'Ediabas Standardeinstellungen (ediabas.ini)'
fr: 'Réglages standards Ediabas (ediabas.ini)'
ru: 'Ediabas настройки по умолчанию (ediabas.ini)'

# PatchVaspcInfo
source: Hint: In VAS-PC only "Guided Fault Finding" and "Guided Functions" are supported with EdiabasLib.
de: Hinweis: In VAS-PC werden nur "Geführte Fehlerkennung" und "Geführte Funktionen" mit EdiabasLib unterstützt.
fr: Astuce : Dans VAS-PC Seulement "Guided Fault Finding" et "Guided Functions" sont supportés avec EdiabasLib.
ru: В VAS-PC с EdiabasLib поддерживаются только "Вед. поиск неисправн." и "Ведомые функции".

# PatchCopyRuntime
source: No VC runtime files installed, copying files locally.
de: Keine VC Runtime-Dateien installiert, Dateien werden lokal kopiert.
fr: Aucun fichier VC runtime installé, copie des fichiers localement.
ru: Файлы библиотеки VC runtime не найдены и будут скопированы локально.

# ElmAdapterConnected
source: The adapter is using the ELM327 firmware, only the replacement firmware is supported.
de: Der Adapter verwendet die ELM327 Firmware, es wird nur die Ersatzfirmware unterstützt.
fr: L'adaptateur utilise le firmware ELM327, seul le firmware modifié est supporté.
ru: Адаптер использует прошивку ELM327, поддерживается только альтернативное программное обеспечение.

# FlashReplacementFirmware
source: The adapter is using the ELM327 firmware, please flash the replacement firmware with the app first.
de: Der Adapter verwendet die ELM327 Firmware, bitte flashen Sie zuerst mit der App die Ersatzfirmware.
fr: L'adaptateur utilise le firmware ELM327, veuillez d'abord flasher le firmware modifié avec l'application.
ru: Адаптер использует прошивку ELM327, пожалуйста, загрузите сначала при помощи приложения альтернативное программное обеспечение.

# WriteModeFailed
source: Write adapter mode failed
de: Adapter-Modus schreiben fehlgeschlagen
fr: Ecriture du mode de adaptater échouée
ru: Не удалось получить режим устройства

# PatchOriginalApiDllMissing
source: Ediabas {0} file is missing.
de: EdiabasLib {0} Datei fehlt.
fr: Le fichier Ediabas {0} est manquant.
ru: Ediabas {0} файл отсутствует.

# PatchApiVersionUnknown
source: Warning: Unknown API version.
de: Warnung: Unbekannte API Version.
fr: Attention: Version API inconnue.
ru: Внимание: Неизвестная версия API.

# IstaRegExtMessage
source: It's recommended pointing the ISTA-D registry key: '{0}' to an external EdiabsLib instance at: '{1}'. You you want to to this?
de: Es wird empfohlen den ISTA-D Registrierungschlüssel: '{0}' auf eine externe EdiabasLib Instanz bei: '{1}' zeigen zu lassen. Wollen Sie dies tun?
fr: Il est recommandé de cibler la clé de registre ISTA-D : '{0}' vers une instance externe EdiabsLib à : '{1}'. Voulez vous l'effectuer ?
ru: Рекомендуется изменить ключ реестра ISTA-D: '{0}' чтобы указать на внешний экземпляр EdiabsLib: '{1}'. Хотите это сделать?

# IstaRegExtTitle
source: Storage location
de: Speicherort
fr: Emplacement du stockage
ru: Место хранения

# PatchRegistry
source: Patching registry key: '{0}'
de: Patchen des Registrierungsschlüssels: '{0}'
fr: Patch de la clé de registre : '{0}'
ru: Исправление ключа реестра: '{0}'

# RemoveRegKeyFailed
source: Removing the registry key '{0}' failed.
de: Löschen des Registrierungsschlüssels '{0}' fehlgeschlagen.
fr: Suppression de la clé de registre '{0}' échouée.
ru: Не удалось удалить ключ регистрации '{0}'.

# RemovingRegKey
source: Removing registry key: '{0}'.
de: Löschen des Registrierungsschlüssels '{0}'.
fr: SUppression de la clé de registre : '{0}'.
ru: Удаление ключa регистрации '{0}'.

# NetFrameworkMissing
source: This application requires .NET Framework {0} or higher.
de: Diese Applikation benötigt .NET Framework {0} oder höher.
fr: Cette application nécessite .NET Framework {0} ou plus récent.
ru: Для этого приложения требуется .NET Framework {0} или выше.

# TitleError
source: Error
de: Fehler
fr: Erreur
ru: Ошибка

# WifiAccessRejected
source: Wi-Fi access has been rejected. Enable location access for this app in the system. Click here to open the system app: {0}
de: Der Wi-Fi Zugriff wurde abgelehnt. Erlauben Sie den Standortzugriff für diese Applikation im System. Hier klicken um die System App zu öffnen: {0}
fr: L'accès Wi-Fi a été refusé. Activer l'accès à la localisation pour cette application dans le système. Cliquer ici pour ouvrir l'application système : {0}
ru: Доступ к Wi-Fi отклонен. Включить доступ к местоположению для этого приложения в системе. Нажмите здесь, чтобы открыть системное приложение: {0}

# PatchIstadInfoEnet
source: 'HO-ICOM / ENET local network'
de: 'HO-ICOM / ENET lokales Netzwerk'
fr: 'Réseau local HO-ICOM / ENET'

# SupportedUsbAdapters
source: Only USB adapters with EdiabasLib firmware are supported.
de: Es werden nur USB Adapter mit EdiabasLib Firmware unterstützt.
fr: Seul les adaptateurs USB avec le firmware EdiabasLib sont supportés.
ru: Поддерживаются только USB-адаптеры с прошивкой EdiabasLib.

# UsbAdaptersHidden
source: Only USB adapters are displayed, which have VID {0} and PID {1}.
de: Es werden nur USB Adapter angezeigt, welche ein VID {0} und PID {1} besitzen.
fr: Seul les adaptateurs USB sont affichés, qui possèdent les VID {0} et PID {1}.
ru: Отображаются только USB-адаптеры с VID {0} и PID {1}.

# PatchingLatencyTime
source: Correcting invalid delay time: {0} ms -> {1} ms
de: Ungültige Wartezeit wird korrigiert: {0} ms -> {1} ms
fr: Correction du délai non valide : {0} ms -> {1} ms
ru: Исправление недопустимого времени задержки: {0} мс -> {1} мс

# PatchingLatencyTimeFailed
source: Changing delay time failed. Please correct it manually.
de: Ändern der Wartezeit fehlgeschlagen. Bitte manuell korrigieren.
fr: La modification du délai a échoué. Veuillez le corriger manuellement.
ru: Не удалось изменить время задержки. Пожалуйста, исправьте вручную.

# ResetUsbDeviceFailed
source: Resetting USB device failed. Disconnect device for manual reset.
de: Das USB Gerät konnte nicht zurückgesetzt werden. Trennen Sie das Gerät für einen manuellen Reset.
fr: Réinitialisation du péfiphérique USB échouée. Déconnecter le périphérique pour un reset manuel.
ru: Сброс USB-устройства не удался. Отсоедините устройство для ручного сброса.

source: Resetting USB device ...
de: Das USB Gerät wird zurückgesetzt ...
fr: Réinitialisation du périphérique USB...
ru: Сброс настроек USB-устройства...

# LatencyTime
source: Delay time: {0} ms
de: Wartezeit: {0} ms
fr: Délai de réponse : {0} ms
ru: Время задержки: {0} мс

# PatchVCRuntimeInstalled
source: The VC++ runtime has not been found. Install the VC++ runtime '{0}' first.
de: Die VC++ Runtime wurde nicht gefunden. Installieren Sie zuerst die VC++ Runtime '{0}'.
fr: Le runtime VC++ n'a pas été trouvé. Installez d'abord le runtime VC++ '{0}'.
ru: Среда выполнения VC++ не найдена. Сначала установите среду выполнения VC++ '{0}'.

# PatchIstadInfoHint
source: Hint: In ISTA-D Administration -> VCI Config select as Interface type:
de: Hinweis: In ISTA-D Administration -> VCI Konfiguration als Interface Typ auswählen:
fr: Astuce : Dans ISTA-D Administration -> selectionner le type d'interface de véhicule comme suit :
ru: Указание: В ISTA-D администрировании -> VCI конфигурация выберите тип интерфейса:

# BtComfirmPairRequest
source: Confirm the Bluetooth pair request first.
fr: Confirmez d’abord la demande d’appairage Bluetooth.
ru: Сначала подтвердите запрос на сопряжение по Bluetooth.

# FirmwareVersion
source: Firmware:
ru: Версия прошивки:

source: Test OK
ru: Тест OK
